# ServerName Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPCalculationServerInfo..::..ServerName Property
MEPCalculationServerInfo Class See Also
---
The Name of the server.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public string ServerName { get; set; }
```

Visual Basic
---
```text
Public Property ServerName As String
	Get
	Set
```

Visual C++
---
```text
public:
property String^ ServerName {
	String^ get ();
	void set (String^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
MEPCalculationServerInfo Class
Autodesk.Revit.DB Namespace